import React from 'react'

const Task28 = () => {
    return (
        <div>
            <p>У ході виконання лабораторної роботи №2 було детально розглянуто та застосовано на практиці основні
                принципи роботи з каскадними таблицями стилів (CSS). Зокрема, було досліджено різні типи селекторів, їх
                особливості та області застосування. Використання селекторів тегів, класів та ідентифікаторів дозволило
                навчитися структурувати стилі та підвищити ефективність їх використання у веб-застосунку.</p>

            <p>Також було опрацьовано складніші селектори, такі як сусідні, дочірні, атрибутні та універсальні
                селектори, що допомогло зрозуміти, як за допомогою CSS можна більш гнучко налаштовувати стильове
                оформлення HTML-елементів. Особлива увага приділялася організації стилів для покращення зручності та
                читабельності коду, а також правильному використанню спадкування та каскадування стилів.</p>

            <p>Окремим важливим аспектом роботи стало застосування CSS для оформлення текстових елементів. Було вивчено
                налаштування шрифтів, зміна кольору тексту, встановлення фону та контурів, що дало можливість створити
                більш привабливий дизайн сторінки. Крім того, було розглянуто застосування стилів для таблиць та
                багаторівневих списків, що є важливим для створення структурованих веб-документів.</p>

            <p>Важливим етапом лабораторної роботи було створення макету звітного HTML-документа у Figma, що дозволило
                на практиці опанувати навички проєктування веб-інтерфейсів перед початком верстки. Після цього було
                виконано перший етап верстки та реалізовано стильове оформлення звітного HTML-документа відповідно до
                розробленого макету.</p>

            <p>Додатково було здійснено роботу з публікацією результатів лабораторної роботи. Фінальні версії звітного
                HTML-документа, власного веб-застосунку та резюме було розміщено у відповідному репозиторії та
                опубліковано у вигляді живих сторінок. Це дозволило отримати практичний досвід роботи з публікацією
                веб-ресурсів та їх демонстрацією.</p>

            <p>Таким чином, у процесі виконання лабораторної роботи було здобуто важливі практичні навички роботи з CSS,
                а також розширено знання про сучасні підходи до стилізації веб-інтерфейсів. Вивчені методи дозволяють
                створювати привабливі, зручні та добре структуровані веб-сторінки, що є важливим у професійній
                діяльності веб-розробника.</p>

        </div>
    )
}
export default Task28
