import React from 'react'

const Task26 = () => {
    return (
        <div>
            <p>
                Псевдокласи
                :focus — цей псевдоклас застосовується до елементів, коли вони отримують фокус (наприклад, при
                натисканні на поле вводу або виборі в списку). У цьому
                коді <code>input:focus</code> та <code>select:focus</code> змінюють стиль полів вводу та списку при їх
                фокусуванні, наприклад, змінюється колір кордону.
                :hover — цей псевдоклас активується, коли користувач наводить курсор миші на елемент. Наприклад,
                у <code>.profile__image img:hover</code> змінюється масштаб картинки при наведенні на неї курсору.
            </p>

            <p>
                Медіа-запити
                @media (max-width: 768px) — цей медіа-запит активується на екранах шириною до 768px, наприклад, на
                планшетах. Змінюються стилі для адаптації інтерфейсу, наприклад, зменшуються відступи або змінюється
                розмір шрифта.
                @media (max-width: 480px) — цей медіа-запит активується для екранних пристроїв з шириною до 480px, таких
                як смартфони. Тут також можуть бути змінені розміри елементів, наприклад, зменшення розміру аватару, а
                також відступів між елементами для кращого відображення на малих екранах.
            </p>

            <p>
                Комбіновані селектори
                input, select — це комбінований селектор, який застосовує стиль одночасно до
                елементів <code>input</code> та <code>select</code>, наприклад, для зміни їхнього зовнішнього вигляду
                при фокусуванні або зміні стану.
                input:focus, select:focus — це поєднання комбінованого селектора з псевдокласом <code>:focus</code>, що
                дозволяє змінювати стиль лише коли елементи набувають фокусу, наприклад, зміна кольору рамки.
            </p>

            <p>
                Дочірні селектори
                .profile__image img — це селектор, який вибирає елементи <code>img</code>, що є дочірніми елементами
                контейнера з класом <code>.profile__image</code>. Це означає, що стилі, як-от визначення розміру
                зображення або його обробка, застосовуються лише до зображень у цьому конкретному блоці.
            </p>

        </div>
    )
}
export default Task26
