import React from 'react'

const Task38 = () => {
    return (
        <div>
            <p>
                Кожному студенту виконати свій номер варіанта Завдання №3, за технологією FLEXBOX та засобами CSS.
                Номер варіанта відповідає останній цифрі студента у списку групи. Наприклад, Студент 18 за списком –
                буде виконувати 8 варіант.

                У звітному HTML-документі розмістити скріншот сторінки, яка була виконана технологією FLEXBOX.
                У звітному HTML-документі розмістити HTML- код та CSS-код сторінки, яка була виконана технологією
                FLEXBOX.
                Вміти пояснити викладачу особливості вашого макету.

            </p>
        </div>
    )
}
export default Task38
