import React from 'react'

const Task33 = () => {
    return (
        <div>
            <p>Засобами HTML та CSS виконати Завдання №2 у звітному HTML-документі , в саме:</p>
            <p>Розмітку за допомогою таблиці (номер варіанта – остання цифра у списку групи)</p>
            <p>Фіксована таблична верстка</p>
            <p>Гумова таблична верстка</p>
            <p>Розмітку за допомогою блоків (плаваючих елементів) (номер варіанта – остання цифра у списку групи +
                1)</p>
            <p>Фіксована блокова верстка</p>
            <p>Гумова блокова верстка</p>
        </div>
    )
}
export default Task33
