import React from 'react'

const Task113 = () => {
    return (
        <div>
            <p>
                У процесі виконання лабораторної роботи №9 було реалізовано повноцінну систему аутентифікації
                користувачів у вебзастосунку з використанням сучасних технологій Node.js. Основним завданням було
                навчитися створювати безпечну систему входу та реєстрації, а також забезпечити перевірку користувача
                через електронну пошту, виконувати модульне тестування, працювати з контейнерами Docker та впровадити
                основи WebSocket-комунікацій.

                Першим кроком стала реалізація механізму реєстрації користувача. Було використано бібліотеку bcrypt для
                хешування паролів перед їх збереженням у базі даних, що є стандартною практикою безпеки у сучасних
                додатках. Хеш-функції дозволяють уникнути зберігання відкритих паролів і підвищити захищеність системи.
                Під час реєстрації користувача було додано логіку надсилання електронного листа з посиланням для
                верифікації за допомогою SMTP-сервісу. Це дозволяє переконатися в автентичності користувача, що є
                критично важливим для медичних або фінансових систем.

                Для реалізації входу користувача було впроваджено створення JWT-токенів за допомогою бібліотеки
                jsonwebtoken, що дозволяє надійно зберігати стан аутентифікації на клієнті без використання сесій. Всі
                захищені маршрути були прикриті middleware-функцією власної реалізації, яка перевіряє валідність токена
                та дозволяє доступ лише авторизованим користувачам. Це показало важливість використання middleware як
                частини архітектури Express-застосунків.


                Ця лабораторна робота стала важливим етапом у вивченні повного стеку розробки MERN і дозволила
                побудувати фундаментальні навички для створення безпечного, масштабованого та протестованого
                вебзастосунку з підтримкою реального часу.
            </p>
        </div>
    )
}
export default Task113
