import React from 'react'
import {assets} from "../../assets/assets.js";

const Task45 = () => {
    return (
        <div>
            <p>Телефонна</p>
            <img src={assets.smartphone} alt="Smartphone"/>
            <img src={assets.smartphone_1} alt="Smartphone"/>
            <p>Фото лікаря (`w-full`) і текстовий блок (`flex-col`) розташовуються у вертикальному порядку.</p>
            <p>Відступи між елементами зменшені (`gap-3 mx-2`), щоб вмістити більше інформації в обмеженому
                просторі.</p>
            <p>Список днів тижня представлений як горизонтальний скрол (`overflow-x-scroll`), і елементи (`min-w-16`)
                мають мінімальну ширину.</p>
            <p>Слоти часу також розташовані горизонтально, але можуть виглядати компактніше.</p>
            <p>Кнопка бронювання залишається великою, щоб легко натискати на сенсорному екрані.</p>

        </div>
    )
}
export default Task45
