import React from 'react'
import {assets} from "../../assets/assets.js";

const Task43 = () => {
    return (
        <div>
            <p>Декстопна</p>
            <img src={assets.dekstop} alt="Dekstop"/>
            <p>Фото лікаря відображається зліва у фіксованому блоці шириною `sm:max-w-72`.</p>
            <p>Основна інформація про лікаря розташована праворуч у контейнері з `border` і `p-8 py-7`.</p>
            <p>Блок з розкладом займає всю ширину та містить список днів тижня у горизонтальному рядку.</p>
            <p>Слоти часу відображаються в одному ряду та доступні для скролу, але зазвичай поміщаються без
                прокручування.</p>
            <p>Кнопка бронювання (`px-14 py-3`) розташована під розкладом і має достатню ширину для зручного кліку.</p>

        </div>
    )
}
export default Task43
