import React from 'react'

const Task46 = () => {
    return (
        <div>
                <h1>Висновок</h1>

                <p>У ході виконання лабораторної роботи №4 було розглянуто та застосовано основні принципи адаптивної
                    верстки, зокрема: використання медіа-запитів, метатега viewport та стратегії Mobile First.</p>

                <p>Було створено три версії веб-сторінки:</p>
                <ul>
                    <li><strong>Десктопну</strong>, яка оптимізована для екранів великої ширини.</li>
                    <li><strong>Планшетну</strong>, що адаптується до середніх розмірів екранів.</li>
                    <li><strong>Мобільну</strong>, яка має спрощене відображення для зручності користувачів смартфонів.
                    </li>
                </ul>

                <p>Також були використані логічні оператори в медіа-запитах для більш гнучкого керування стилями.</p>

                <p>В результаті виконання роботи було здобуто практичні навички створення адаптивних інтерфейсів, що
                    дозволяють веб-сторінці коректно відображатися на різних пристроях, покращуючи досвід
                    користувачів.</p>
        </div>
    )
}
export default Task46
