import React from 'react';

const Task42 = () => {
    return (
        <div>
            <p>1. У звітному HTML-документі розмістити тему та постановку задачі лабораторної роботи №4.</p>

            <p>2. Використовуючи медіа-запити та CSS-правила, для вибраних вами брейкпоінтів, виконати адаптивну верстку для:</p>
            <ul>
                <li>Десктопної версії</li>
                <li>Планшетної версії</li>
                <li>Мобільної версії</li>
            </ul>

            <p>3. У звітному HTML-документі привести пояснення створення десктопної, планшетної та мобільної версії.</p>

            <p>4. В процесі розробки адаптивної верстки, застосувати логічні оператори.</p>

            <p>5. Оформлення звітного HTML-документа лабораторної роботи №5 виконати на свій розсуд.</p>
        </div>
    );
};

export default Task42;
