import React from 'react'

const Task14 = () => {
    return (
        <div className="max-w-6xl mx-auto p-4">
            <h1 className="text-3xl font-bold text-center mb-8">Висновки</h1>

            <section className="bg-white shadow-lg rounded-lg p-6 mb-8">
                <h3 className="text-xl font-semibold mb-2">Отже</h3>
                <ul className="list-disc list-inside text-gray-700">
                    <li>у результаті виконання лабораторної роботи №1 я здобув важливі практичні навички у роботі з
                        веб-технологіями, зокрема в використанні GitHub, Git, HTML, а також у створенні веб-застосунків.
                    </li>
                    <li>Розглянувши кожен етап роботи, я навчився не тільки ефективно працювати з репозиторіями на
                        GitHub, а й застосовувати основні HTML-теги та атрибути для створення структурованих
                        веб-сторінок.
                    </li>
                </ul>

                <h3 className="text-xl font-semibold mt-6 mb-2">Основні етапи роботи</h3>
                <ul className="list-disc list-inside text-gray-700">
                    <li><strong>Вибір предметної галузі та опис бізнес-логіки:</strong> Я успішно обрав предметну галузь
                        для створення веб-застосунку, описав його функціонал і створив короткий опис бізнес-логіки, який
                        надав змогу сформулювати вимоги до системи.
                    </li>
                    <li><strong>Робота з GitHub:</strong> Я зареєструвався на GitHub, створив репозиторій для свого
                        веб-застосунку, налаштував його та освоїв основні команди Git, зокрема команду для клону
                        репозиторію, додавання змін і їх збереження через коміти.
                    </li>
                    <li><strong>Створення HTML-документа:</strong> Одна з основних частин лабораторної роботи полягала у
                        створенні HTML-документа, який мав містити різні елементи: заголовки різних рівнів, таблиці,
                        списки, форми, зображення та посилання.
                    </li>
                    <li><strong>Інтеграція з Figma:</strong> Я ознайомився з основами роботи в Figma, що дозволило мені
                        створити макет веб-застосунку, який відповідав поставленим вимогам.
                    </li>
                    <li><strong>Формування звітного HTML-документа:</strong> Під час роботи над звітним документом я
                        створив таблиці, зображення, списки та використав різні атрибути для кожного елемента.
                    </li>
                    <li><strong>Робота з репозиторіями та хостингом:</strong> Створення репозиторіїв на GitHub та
                        налаштування хостингу для демонстрації результатів роботи дозволило мені повноцінно опанувати
                        процеси завантаження проєктів на платформу.
                    </li>
                </ul>
            </section>


        </div>
    )
}
export default Task14
