import React from 'react'

const Task52 = () => {
    return (
        <div>
            <p>Варінт: 2432(парний)</p>
            <p>Таблиця 1</p>
            <p>2</p>
            <p>Напишіть функцію getProductDetails, яка приймає ідентифікатор товару productId та дві колбек-функції
                successCallback та errorCallback.

                Функція getProductDetails повинна отримати деталі про вказаний товар та передати їх у successCallback.

                У випадку якщо товар не знайдено, викликається errorCallback і передається повідомлення про помилку.
            </p>
            <p>4</p>
            <p>З об&#39;єкту concerts отримати масив, який буде містити лише імена міст.
                З масиву потрібно прибрати міста, в яких концерт уже пройшов і відсортувати їх у хронологічному порядку.
                Результат вивести у консоль.
                Очікуваний результат [&#34;Одеса&#34;, &#34;Умань&#34;, &#34;Харків&#34;]
                Застосувати стрілочні функції
                const concerts
                Київ: new Date(&#34;2020-04-01&#34;),
                Умань: new Date(&#34;2025-07-02&#34;),
                Вінниця: new Date(&#34;2020-04-21&#34;),
                Одеса: new Date(&#34;2025-03-15&#34;),
                Хмельницький: new Date(&#34;2020-04-18&#34;),
                Харків: new Date(&#34;2025-07-10&#34;),
            </p>
            <p>6</p>
            <p>Напишіть функцію, яка приймає массив об&#39;єктів і повертає новий массив об&#39;єктів,у якому є знижка
                на 30 % на всі медикаменти ціна, яких перевищує 300 грн у масиві Надайте ід для кожного медикамента
                const medicines =
                name: &#34;Noshpa&#34;, price: 170 ,
                name: &#34;Analgin&#34;, price: 55 ,
                name: &#34;Quanil&#34;, price: 310 ,
                name: &#34;Alpha choline&#34;, price: 390 ,
                ;
            </p>
            <p>8</p>
            <p> Напиши функцію конструктор Storage який створює об&#39;єкти Для управління складом товарів. При виклику
                отримуватиме один агрумент - початковий масив товарів, і записувати їх у властивість items.
                Додай методи класу: getItems() - повертайте масив товарів addItems(item) - отримує новий товар та додає
                його до поточних removeItem(item) - отримує товар і, якщо він є, видаляє його з поточних
                const arr = [&#34;apple&#34;, &#34;banana&#34;, &#34;mango&#34;]
            </p>
            <p>9</p>
            <p>Поверніть об'єкт, в якому вказано кількість тегів.
                Очікуваний результат js: 3, nodejs: 3, html: 2, css: 2, react: 2

                const tweets =
                id: &#34;000&#34;, likes: 5, tags: [&#34;js&#34;, &#34;nodejs&#34;] ,
                id: &#34;001&#34;, likes: 2, tags: [&#34;html&#34;, &#34;css&#34;] ,
                id: &#34;002&#34;, likes: 17, tags: [&#34;html&#34;, &#34;js&#34;, &#34;nodejs&#34;] ,
                id: &#34;003&#34;, likes: 8, tags: [&#34;css&#34;, &#34;react&#34;] ,
                id: &#34;004&#34;, likes: 0, tags: [&#34;js&#34;, &#34;nodejs&#34;, &#34;react&#34;],
            </p>
            <p>10</p>
            <p>Напишіть функцію checkBrackets(str) яка приймає рядок жс коду (someFn) і перевіряє правильність закриття
                дужок () {} []
                Якщо рядок містить коректний код функція повертає true.
                В іншому випадку повертає false
            </p>
        </div>
    )
}
export default Task52
