import React from 'react'

const Task54 = () => {
    return (
        <div>
            <p>Таблиця 2</p>
            <p>2</p>
            <p>Дано масив об&#39;єктів.
                Перевірте, чи є хоча б один об&#39;єкт з віком менше 20 років.
                Очікуваний результат: true.
                const people =
                name: &#39;John&#39;, age: 27 ,
                name: &#39;Jane&#39;, age: 31 ,
                name: &#39;Bob&#39;, age: 19 ,
                ;
            </p>
            <p>4</p>
            <p>Дано масив чисел [1, 2, 3, 4, 5]. Створіть новий масив, що містить
                квадрати кожного елементу вхідного масиву.
                Очікуваний результат: [1, 4, 9, 16, 25].
                const numbers = [1, 2, 3, 4, 5]
            </p>
            <p>6</p>
            <p> Відсортуйте масив об&#39;єктів за віком у порядку зростання.
                Очікуваний результат: [name: &#34;Bob&#34;, age: 19, name: &#34;John&#34;, age: 27,
                name: &#34;Jane&#34;, age: 31].

                const users = [
                name: &#39;John&#39;, age: 27 ,
                name: &#39;Jane&#39;, age: 31 ,
                name: &#39;Bob&#39;, age: 19 ;]
            </p>
            <p>7</p>
            <p>Розроби клас Calculator, який дозволяє виконувати арифметичні
                операції над числом за допомогою методів класу, підтримуючи
                ланцюжковий виклик (method chaining).

                Вимоги до класу Calculator
                - Метод number(value)
                Встановлює початкове значення для наступних обчислень.
                Повертає сам об&#39;єкт (this) для підтримки ланцюжкових викликів.

                - метод getResult, Повертає поточний результат усіх операцій.
                Не змінює значення, просто повертає його.

                - метод add - Додає value до поточного значення.
                Повертає сам об&#39;єкт (this) для підтримки ланцюжкових викликів.

                - метод substruct - Віднімає value від поточного значення. Повертає this.

                - метод divide - Ділить поточне значення на value, якщо value не дорівнює 0.
                Якщо value === 0, викидає помилку з повідомленням про неможливість ділення.
                Повертає сам об&#39;єкт (this) для підтримки ланцюжкових викликів.

                - метод multiply -Множить поточне значення на value. Повертає this.

                Об&#39;єкт класу може проводити послідовні операції у вигляді ланцюжка

                Приклад використання:
                const calc = new Calculator();


                const result = calc
                .number(10) Встановлюємо початкове значення 10
                .add(5) Додаємо 5 (10 + 5 = 15)
                .subtract(3) Віднімаємо 3 (15 - 3 = 12)
                .multiply(4) Множимо на 4 (12 * 4 = 48)
                .divide(2) Ділимо на 2 (48 / 2 = 24)
                .getResult(); Отримуємо результат: 24


                console.log(result); // 24
            </p>
        </div>
    )
}
export default Task54
