import React from 'react'

const Task56 = () => {
    return (
        <div>
            <p>У ході виконання лабораторної роботи №4 було набуте практичне розуміння роботи з об'єктами, їх методами,
                масивами об'єктів та їх обробкою за допомогою стрілочних функцій і колбеків.</p>

            <p>Я ознайомився з такими важливими концепціями JavaScript, як:</p>

            <ul>
                <li><b>Створення та маніпуляція об'єктами</b> – додавання унікальних ідентифікаторів, зміна
                    властивостей.
                </li>
                <li><b>Використання колбек-функцій</b> – передача функцій у якості аргументів для обробки даних.</li>
                <li><b>Робота зі стрілочними функціями</b> – застосування їх як колбеків та для скорочення синтаксису.
                </li>
                <li><b>Методи масивів</b> –
                    використання <code>map()</code>, <code>filter()</code>, <code>reduce()</code>, <code>sort()</code>, <code>some()</code>, <code>every()</code> для
                    ефективної роботи з масивами.
                </li>
                <li><b>Обробка та сортування даних</b> – фільтрація та сортування масивів на основі певних критеріїв.
                </li>
                <li><b>Створення класів та конструкторів</b> – написання класів з приватними властивостями та методами,
                    а також реалізація патерну "method chaining".
                </li>
            </ul>

            <p>Виконані завдання дозволили закріпити отримані знання на практиці та краще зрозуміти, як використовувати
                можливості JavaScript для обробки даних.</p>

        </div>
    )
}
export default Task56
