import React from 'react'

const Task63 = () => {
    return (
        <div><p>
            У рамках лабораторної роботи було реалізовано кілька практичних завдань на основі JavaScript, що стосуються
            об'єктної моделі документа (DOM), подій, делегування подій, використання колбеків, стрілочних функцій, а
            також реалізації механізму throttle. Метою роботи було закріплення знань та розвитку навичок у роботі з
            основними концепціями JavaScript і взаємодії з елементами веб-сторінки через DOM.

            У ході виконання завдань було реалізовано різноманітні сценарії взаємодії з елементами сторінки. Зокрема, у
            завданні 2 було реалізовано обмін вмістом між двома інпутами за допомогою маніпуляцій з DOM та обробки
            подій. Завдання 4 передбачало зміну розміру квадрата за допомогою кнопок, що дозволяє працювати зі стилями
            елементів через JavaScript. Завдання 6 полягало в подвоєнні значень у списку за допомогою кнопки, що
            дозволяє змінювати вміст елементів DOM. Завдання 7 включало підрахунок кількості категорій та елементів у
            списку, що реалізовано за допомогою методів для навігації по DOM та методів масивів, таких як forEach(). У
            завданні 8 було реалізовано обробку події відправлення форми логіна, де перевіряються незаповнені поля та
            виводяться їх значення в консоль при правильному заповненні. Завдання 9 дозволяло змінювати колір фону
            сторінки через кнопку, використовуючи випадкові кольори, що генеруються за допомогою функції
            getRandomHexColor(). Завдання 10 включало створення та очищення колекції елементів за допомогою інпутів і
            кнопок, що дозволяє маніпулювати DOM-елементами в реальному часі.

            В результаті виконання лабораторної роботи було набуте практичне розуміння роботи з об'єктною моделлю
            документа (DOM), обробки подій, використання методів для маніпуляцій з елементами веб-сторінки, а також
            застосування сучасних JavaScript-концепцій, таких як стрілочні функції, колбеки та делегування подій. Усі
            завдання дозволили закріпити теоретичні знання на практиці, що є важливим етапом у розвитку навичок роботи з
            JavaScript та створення інтерактивних веб-сторінок.
        </p></div>
    )
}
export default Task63
